# VertexPosition Class

---
A geometry vertex specified as a position in space.
SystemObject Autodesk.Revit.DB.DirectContext3DVertex Autodesk.Revit.DB.DirectContext3DVertexPosition
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class VertexPosition : Vertex

    Public Class VertexPosition
    	Inherits Vertex

    public ref class VertexPosition : public Vertex

    type VertexPosition =
        class
            inherit Vertex
        end
The VertexPosition type exposes the following members.
| Name| Description
---|---|---
| VertexPosition|  Constructs the vertex from a point.
Top
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from Vertex)
| Position|  The vertex's position.
Top
| Name| Description
---|---|---
| Dispose| (Inherited from Vertex)
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetSizeInFloats|  Gets the amount of storage that the vertex takes up in a buffer, measured in floats.
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
Since these vertices do not have a color their color is obtained from the EffectInstance
#### Reference
Autodesk.Revit.DB.DirectContext3D Namespace